aguegu/stm32-template/src/demo.cpp
#include "stm32-template.h"

Gpio led_green(GPIOC, GPIO_Pin_9, RCC_APB2Periph_GPIOC);
Gpio led_blue(GPIOC, GPIO_Pin_8, RCC_APB2Periph_GPIOC);

Gpio servo1(GPIOB, GPIO_Pin_6, RCC_APB2Periph_GPIOB);
Gpio servo2(GPIOB, GPIO_Pin_7, RCC_APB2Periph_GPIOB);
Gpio servo3(GPIOB, GPIO_Pin_8, RCC_APB2Periph_GPIOB);
Gpio servo4(GPIOB, GPIO_Pin_9, RCC_APB2Periph_GPIOB);

TimOc t4_oc1(TIM4, TIM_OC1Init, TIM_SetCompare1);
TimOc t4_oc2(TIM4, TIM_OC2Init, TIM_SetCompare2);
TimOc t4_oc3(TIM4, TIM_OC3Init, TIM_SetCompare3);
TimOc t4_oc4(TIM4, TIM_OC4Init, TIM_SetCompare4);

void setup() {

	led_green.init(GPIO_Mode_Out_PP);
	led_blue.init(GPIO_Mode_Out_PP);

	servo1.init(GPIO_Mode_AF_PP);
	servo2.init(GPIO_Mode_AF_PP);
	servo3.init(GPIO_Mode_AF_PP);
	servo4.init(GPIO_Mode_AF_PP);

	Tim t4(TIM4, RCC_APB1Periph_TIM4, RCC_APB1PeriphClockCmd);
	t4.init(1000000, 20000);

	t4_oc1.init(TIM_OCMode_PWM1, TIM_OutputState_Enable,
				TIM_OutputNState_Disable);

	t4_oc2.init(TIM_OCMode_PWM1, TIM_OutputState_Enable,
				TIM_OutputNState_Disable);

	t4_oc3.init(TIM_OCMode_PWM1, TIM_OutputState_Enable,
				TIM_OutputNState_Disable);

	t4_oc4.init(TIM_OCMode_PWM1, TIM_OutputState_Enable,
			TIM_OutputNState_Disable);

	nvic.configure(TIM2_IRQn, 0, 3, ENABLE);
	Tim t2(TIM2, RCC_APB1Periph_TIM2, RCC_APB1PeriphClockCmd);
	t2.init(1000, 1000);
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
	TIM_Cmd(TIM2, ENABLE);

	t4_oc1.setCompare(1000);
	t4_oc2.setCompare(1000);
	t4_oc3.setCompare(1000);
	t4_oc4.setCompare(1000);
}

void loop() {

	while (usart.available()) {
		char c = usart.read();
		fprintf(stdout, "0x%02X\r\n", c);
		t4_oc4.setCompare((uint16_t) c * 100);
		led_blue.toggle();
	}

	led_blue.toggle();
	delay(1000);
}

